
## Plan Result (aat)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0]
  * module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "main" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Monitors for application insight reaching it's daily cap."
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "uksouth"
      + name                                   = "Application Insights daily cap reached - civil-rtl-export-appinsights-aat"
      + resource_group_name                    = "civil-rtl-export-aat"
      + scopes                                 = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod",
        ]
      + severity                               = 4
      + tags                                   = {
          + "application"         = "civil"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/civil-rtl-export.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "staging"
          + "managedBy"           = "Civil"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups     = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts",
            ]
          + custom_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C020H1XLM9S"
            }
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureActivity 
                  | where ResourceId == "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-rtl-export-aat/providers/Microsoft.Insights/components/civil-rtl-export-appinsights-aat"
                  | where OperationNameValue == "Microsoft.Insights/Components/DailyCapReached/Action"
                  | where Level == "Warning"
                  | where Category == "Administrative"
                  | where TimeGenerated > ago(1d)
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0] will be created
  + resource "null_resource" "fix_scheduled_query_rules_alert_v2" {
      + id       = (known after apply)
      + triggers = {
          + "alert_id" = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":113,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->